<html>
	<head>
		<title>Bitacora de Actividades</title>
	</head>

	<body leftmargin="10px" topmargin="30px" rightmargin="10px" >
		<h2> <b>
			<center>Bit&aacute;cora de Actividades:</center>
		</b> <h2>

		<p >
			<h4>
			<b>Integrantes:<br></b>
				Oswaldo Bayona Andrade<br>
				Rodrigo Castro Reyes<br>
				Jorge Vergara Palma<br>
		    </h4>
		</p>
		<hr/>
		<p>
			<h4>
				<b>Primer d&iacute;a:</b>
			</h4>
			Fecha: Mi&eacute;rcoles 13 de agosto del 2014.<br>
			Hora: 4:30 pm a 5:30 pm<br>
			Lugar: Biblioteca de la Fiec Espol<br>
			Asistencia: todos fuimos.<br>
			En esa reuni&oacute;n, primero dise&ntilde;amos el escenario que ibamos a construir, entonces lo
			construimos en un sesenta por ciento, porque faltaba colocar las texturas, los &aacute;rboles
			y la vegetaci&oacute;n. Por lo tanto investigamos como colocar las texturas, la informaci&oacute;n que utilizamos lo sacamos de sitio web 
			<a href="http://www.jlabstudio.com/webgl/2013/04/three-js-tutorial-3-texturas-iluminacion-y-transparencias/"> link</a>. Colocamos la textura de piedra a una de las esferas y dimos por 
			terminada la reuni&oacute;n. M&aacute;s tarde en la noche, Rodrigo agrego&oacute; las texturas que faltaban. 
			</a><br>

		</p>
		
		<hr/>
		<p>
			<h4>
				<b>Segundo d&iacute;a: </b>
			</h4>
			Fecha: jueves 14 de agosto del 2014.<br>
			Hora: 6:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa.<br>

			Actividades: Oswaldo intent&oacute; importar un modelo de &aacute;rbol descargado de internet
			en la escena, pero lastimosamente no pudo, fue dif&iacute;cil buscar el modelo y m&aacute;s dif&iacute;cil importarlo, por lo que desisti&oacute; de esa idea. Oswaldo opt&oacute; por dise&ntilde;ar su propio &aacute;rbol usando pol&iacute;gonos y texturas. Los &aacute;rboles resultantes quedaron m&aacute;s o menos realistas. M&aacute;s tarde Rodrigo mejor&oacute; un poco su apariencia.<br>

		</p>
		<hr/>
		<p>
			<h4>
				<b>Tercer d&iacute;a:</b>
			</h4>
			Fecha: Domingo 17 de agosto del 2014.<br>
			Hora: 6:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Jorge y Rodrigo se dedicaron ha mejorar el escenario, colocarle m&aacute;s detalles, un portaretrato, una ventana, etc. Tambi&eacute;n investigaron el algoritmo de Flocking para el movimiento en grupo de las esferas. Oswaldo coloc&oacute; los controles para cambiar la textura de los objetos de la escena.  


		</p>

		<hr/>
		<p>
			<h4>
				<b>Cuarto d&iacute;a: </b>
			</h4>
			Fecha: s&aacute;bado 6 de septiembre del 2014.<br>
			Hora: 11:30 am<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Rodrigo investig&oacute; como hacer que las esferas sigan el movimiento del mouse; Oswaldo busc&oacute; como obtener la coordenada 3D del mouse al dar click en la escena, acci&oacute;n que iba a ser usada para la animaci&oacute;n n&uacute;mero uno, adem&aacute;s como hacer deteccion de colisiones, informaci&oacuten extra&iacute;da de este ejemplo <a href="http://stemkoski.github.io/Three.js/Collision-Detection.html">Ejemplo</a>. Oswaldo le deleg&oacute; a Jorge analizarlo para aplicalo en nuestro proyecto. Nosotros decidimos hacer el proyecto en tres archivos diferentes, uno para cada animaci&oacute;n.  Oswaldo termin&oacute; en un cincuenta por ciento la primera Animaci&oacute;n y Jorge en un cuarenta por ciento la segunda.
			

		</p>
		<hr/>

		<p>
			<h4>
				<b>Quinto d&iacute;a: </b>
			</h4>
			Fecha: Domingo 7 de septiembre del 2014.<br>
			Hora: 7:30 pm<br>
			Lugar: no hubo reuni&oacute;n, cada quien trabaj&oacute; en su casa, pero exist&iacute;a comunicaci&oacute;n v&iacute;a chat entre los tres.<br>

			Actividades: Oswaldo termino la primera y tercera animaci&oacute;n, Jorge y Rodrigo terminar&oacute;n la segunda; todo el proyecto se encuentra subido en este repositorio en Github 
			<a href="https://github.com/rodrigoCastroReyes/GraficosSegundoParcial">Repositorio</a>.




	</body>
</html>